{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFC"
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "ВЎ": 98,
      "Вў": 99,
      "ВЈ": 100,
      "ВӨ": 101,
      "ВҘ": 102,
      "ВҰ": 103,
      "В§": 104,
      "ВЁ": 105,
      "В©": 106,
      "ВӘ": 107,
      "В«": 108,
      "В¬": 109,
      "В®": 110,
      "ВҜ": 111,
      "В°": 112,
      "Вұ": 113,
      "ВІ": 114,
      "Ві": 115,
      "Вҙ": 116,
      "Вө": 117,
      "В¶": 118,
      "В·": 119,
      "Вё": 120,
      "В№": 121,
      "Вә": 122,
      "В»": 123,
      "Вј": 124,
      "ВҪ": 125,
      "Вҫ": 126,
      "Вҝ": 127,
      "ГҖ": 128,
      "ГҒ": 129,
      "ГӮ": 130,
      "Гғ": 131,
      "Г„": 132,
      "Г…": 133,
      "ГҶ": 134,
      "ГҮ": 135,
      "ГҲ": 136,
      "Гү": 137,
      "ГҠ": 138,
      "ГӢ": 139,
      "ГҢ": 140,
      "ГҚ": 141,
      "ГҺ": 142,
      "ГҸ": 143,
      "Гҗ": 144,
      "Г‘": 145,
      "Г’": 146,
      "Г“": 147,
      "Г”": 148,
      "Г•": 149,
      "Г–": 150,
      "Г—": 151,
      "Гҳ": 152,
      "Гҷ": 153,
      "Гҡ": 154,
      "Гӣ": 155,
      "Гң": 156,
      "Гқ": 157,
      "Гһ": 158,
      "Гҹ": 159,
      "Г ": 160,
      "ГЎ": 161,
      "Гў": 162,
      "ГЈ": 163,
      "ГӨ": 164,
      "ГҘ": 165,
      "ГҰ": 166,
      "Г§": 167,
      "ГЁ": 168,
      "Г©": 169,
      "ГӘ": 170,
      "Г«": 171,
      "Г¬": 172,
      "Гӯ": 173,
      "Г®": 174,
      "ГҜ": 175,
      "Г°": 176,
      "Гұ": 177,
      "ГІ": 178,
      "Гі": 179,
      "Гҙ": 180,
      "Гө": 181,
      "Г¶": 182,
      "Г·": 183,
      "Гё": 184,
      "Г№": 185,
      "Гә": 186,
      "Г»": 187,
      "Гј": 188,
      "ГҪ": 189,
      "Гҫ": 190,
      "Гҝ": 191,
      "ДҖ": 192,
      "ДҒ": 193,
      "ДӮ": 194,
      "Дғ": 195,
      "Д„": 196,
      "Д…": 197,
      "ДҶ": 198,
      "ДҮ": 199,
      "ДҲ": 200,
      "Дү": 201,
      "ДҠ": 202,
      "ДӢ": 203,
      "ДҢ": 204,
      "ДҚ": 205,
      "ДҺ": 206,
      "ДҸ": 207,
      "Дҗ": 208,
      "Д‘": 209,
      "Д’": 210,
      "Д“": 211,
      "Д”": 212,
      "Д•": 213,
      "Д–": 214,
      "Д—": 215,
      "Дҳ": 216,
      "Дҷ": 217,
      "Дҡ": 218,
      "Дӣ": 219,
      "Дң": 220,
      "Дқ": 221,
      "Дһ": 222,
      "Дҹ": 223,
      "Д ": 224,
      "ДЎ": 225,
      "Дў": 226,
      "ДЈ": 227,
      "ДӨ": 228,
      "ДҘ": 229,
      "ДҰ": 230,
      "Д§": 231,
      "ДЁ": 232,
      "Д©": 233,
      "ДӘ": 234,
      "Д«": 235,
      "Д¬": 236,
      "Дӯ": 237,
      "Д®": 238,
      "ДҜ": 239,
      "Д°": 240,
      "Дұ": 241,
      "ДІ": 242,
      "Ді": 243,
      "Дҙ": 244,
      "Дө": 245,
      "Д¶": 246,
      "Д·": 247,
      "Дё": 248,
      "Д№": 249,
      "Дә": 250,
      "Д»": 251,
      "Дј": 252,
      "ДҪ": 253,
      "Дҫ": 254,
      "Дҝ": 255,
      "ЕҖ": 256,
      "ЕҒ": 257,
      "ЕӮ": 258,
      "Еғ": 259,
      "Г„Вұ": 260,
      "ir": 261,
      "Д d": 262,
      "ГғВј": 263,
      "Д b": 264,
      "en": 265,
      "Д k": 266,
      "an": 267,
      "in": 268,
      "im": 269,
      "Д a": 270,
      "Д y": 271,
      "ek": 272,
      "Д da": 273,
      "Д bir": 274,
      "er": 275,
      "ev": 276,
      "il": 277,
      "iz": 278,
      "ГғВ§": 279,
      "Г…ЕҒ": 280,
      "Д s": 281,
      "Г„Вұr": 282,
      "imiz": 283,
      "ac": 284,
      "da": 285,
      "den": 286,
      "el": 287,
      "ey": 288,
      "iy": 289,
      "kГ„Вұ": 290,
      "su": 291,
      "Г„ЕҒ": 292,
      "Д o": 293,
      "enin": 294,
      "evr": 295,
      "ak": 296,
      "ay": 297,
      "et": 298,
      "eden": 299,
      "ge": 300,
      "ik": 301,
      "la": 302,
      "lan": 303,
      "ler": 304,
      "ma": 305,
      "mГ„Вұ": 306,
      "nda": 307,
      "nsu": 308,
      "ok": 309,
      "onsu": 310,
      "tir": 311,
      "tГ„Вұr": 312,
      "ur": 313,
      "ve": 314,
      "Д m": 315,
      "Д u": 316,
      "Д evr": 317,
      "Д ge": 318,
      "Д ve": 319
    },
    "merges": [
      [
        "Г„",
        "Вұ"
      ],
      [
        "i",
        "r"
      ],
      [
        "Д ",
        "d"
      ],
      [
        "Гғ",
        "Вј"
      ],
      [
        "Д ",
        "b"
      ],
      [
        "e",
        "n"
      ],
      [
        "Д ",
        "k"
      ],
      [
        "a",
        "n"
      ],
      [
        "i",
        "n"
      ],
      [
        "i",
        "m"
      ],
      [
        "Д ",
        "a"
      ],
      [
        "Д ",
        "y"
      ],
      [
        "e",
        "k"
      ],
      [
        "Д d",
        "a"
      ],
      [
        "Д b",
        "ir"
      ],
      [
        "e",
        "r"
      ],
      [
        "e",
        "v"
      ],
      [
        "i",
        "l"
      ],
      [
        "i",
        "z"
      ],
      [
        "Гғ",
        "В§"
      ],
      [
        "Г…",
        "ЕҒ"
      ],
      [
        "Д ",
        "s"
      ],
      [
        "Г„Вұ",
        "r"
      ],
      [
        "im",
        "iz"
      ],
      [
        "a",
        "c"
      ],
      [
        "d",
        "a"
      ],
      [
        "d",
        "en"
      ],
      [
        "e",
        "l"
      ],
      [
        "e",
        "y"
      ],
      [
        "i",
        "y"
      ],
      [
        "k",
        "Г„Вұ"
      ],
      [
        "s",
        "u"
      ],
      [
        "Г„",
        "ЕҒ"
      ],
      [
        "Д ",
        "o"
      ],
      [
        "en",
        "in"
      ],
      [
        "ev",
        "r"
      ],
      [
        "a",
        "k"
      ],
      [
        "a",
        "y"
      ],
      [
        "e",
        "t"
      ],
      [
        "e",
        "den"
      ],
      [
        "g",
        "e"
      ],
      [
        "i",
        "k"
      ],
      [
        "l",
        "a"
      ],
      [
        "l",
        "an"
      ],
      [
        "l",
        "er"
      ],
      [
        "m",
        "a"
      ],
      [
        "m",
        "Г„Вұ"
      ],
      [
        "n",
        "da"
      ],
      [
        "n",
        "su"
      ],
      [
        "o",
        "k"
      ],
      [
        "o",
        "nsu"
      ],
      [
        "t",
        "ir"
      ],
      [
        "t",
        "Г„Вұr"
      ],
      [
        "u",
        "r"
      ],
      [
        "v",
        "e"
      ],
      [
        "Д ",
        "m"
      ],
      [
        "Д ",
        "u"
      ],
      [
        "Д ",
        "evr"
      ],
      [
        "Д ",
        "ge"
      ],
      [
        "Д ",
        "ve"
      ]
    ]
  }
}